//소수점 완벽한가?
//1. 0.123 가능한가? O
// 2. 0.123.321 안되는가? O
// 3. 0..123 안되는가? O
// 4. 0.123 + 0.000123 되는가? O
// 5. 0.123 + 0.321 = 0.444 되는가? O
// 6. 123.321.123 안되는가? O
// 7. 123.321 되는가? O
// 8. 000000으로 안되는가? O
// 9. 0.123 + 000000 안되는가? O
// 10. 0.123 + 0.0000123 되는가? O
// 11. 0.123 + 0.000.123 안되는가? O
// 12. 0.123 + 0.. 안되는가? O
// 13. 12.+ 안되는가? O
//14. 0.0000000 되는가? O
//15. 0.123 + 0.0000 되는가? O
//16. 2000200 가능한가? O
//17. 21+023 안되는가? O
// 18.

// import React from 'react';
// import renderer from 'react-test-renderer';
// import App from './App';

// describe('<App />', () => {
//   it('has 1 child', () => {
//     App.makeNumbers('1');
//     expect(1).toBe(1);
//   });
// });
